;--------------------------------------------------------------------------------
[Lang]
Lang=English (Default)
;--------------------------------------------------------------------------------
[102]
102=Find..
1012=&Find what:
1009=&Replace:
1003=&Match Case
1004=&Whole Word
1014=&Ignore Whitespace
1005=&Project
1013=Direction
1006=&Down
1007=&Up
1008=&All
1=Find
1010=Replace
1011=Replace All
2=Cancel
;--------------------------------------------------------------------------------
[103]
103=Goto Line
1001=Line:
1=OK
2=Cancel
;--------------------------------------------------------------------------------
[150]
2=Cancel
1001=< Back
1=Finish
1002=Next >
;--------------------------------------------------------------------------------
[151]
151=Project Wizard - Type & Name
1001=Assembler
1002=Project Type
1003=Project Name:
1004=Project Description:
1005=Projects Folder:
;--------------------------------------------------------------------------------
[152]
152=Project Wizard - Template
;--------------------------------------------------------------------------------
[153]
153=Project Wizard - Files & Folders
1001=File Creation
1002=Folder Creation
620=Import
;--------------------------------------------------------------------------------
[154]
154=Project Wizard - Make
1001=Make Menu
1002=Compile RC:
1003=Assemble:
1004=Link:
1005=Run:
1006=Run w/debug:
1007=Res To Obj:
1008=Asm Module:
;--------------------------------------------------------------------------------
[155]
155=Import
1002=Browse
1=OK
2=Cancel
1004=Include sub directories
;--------------------------------------------------------------------------------
[2000]
2000=Create Template
2007=Description
2009=Additional Files
2003=Add
2004=Remove
2008=Template Filename
1=OK
2=Cancel
;--------------------------------------------------------------------------------
[2200]
2200=Sniplet Options
2207=Double Click Action
2201=Select All
2202=Copy To Editor
2203=Copy To Clipboard
2204=Copy To Output
2205=Close
2206=Open expanded
1=OK
2=Cancel
10=Apply
;--------------------------------------------------------------------------------
[2300]
2300=Paths Setup
1=OK
2=Cancel
10=Apply
;--------------------------------------------------------------------------------
[2500]
2500=Menu Editor
1=OK
2=Cancel
2528=Export
2529=Remove
2501=Menu
2502=Name:
2504=MenuID:
2506=ItemStartID:
2510=Menu item
2511=Caption:
2514=Shortcut:
2515=Name:
2517=ItemID:
2526=Checked
2527=Grayed
2530=Inactive
2508=Right align
2509=Radio
2531=Ownerdraw
2532=Right Order
2519=Insert
2520=Delete
;--------------------------------------------------------------------------------
[2600]
2600=Dialog Editor Options
1=OK
2=Cancel
10=Apply
2615=Grid X-Size
2616=Grid Y-Size
2614=Grid color
2617=Dialog ID
2618=Control ID
2605=Show Grid
2606=Snap To Grid
2607=Show Pos/Size
2611=Grid as lines
2608=Save RC File
2609=Simple Property
2619=Limitted font info
;--------------------------------------------------------------------------------
[2700]
2700=Project Options
2726=Make Menu
2717=Description
2722=Release
2723=Debug
2718=Compile Rc
2719=Assemble
2720=Link
2721=Run
2727=Run w/debug
2728=Res To Obj
2729=Asm Module
2724=Show groups
2725=Expand groups
2730=Paths
2731=Main Files
1=OK
2=Cancel
10=Apply
;--------------------------------------------------------------------------------
[2800]
2800=Code Editor Options
1=OK
2=Cancel
10=Apply
2850=Tab && Space
2851=Tab Size
2815=Convert Tab to Space
2806=Auto Indent
2852=Window handling
2809=Save Pos and Size
2820=Always on Top
2811=Always Maximized
2817=Single Instance
2812=Use Mouse Wheel
2853=Files
2854=Backup Copies
2837=File Change Notify
2805=Auto Save on Build
2831=Auto Load Project
2855=Code Files
2856=Line numbers / Page size
2858=Page size (lines)
2821=Show on open
2859=Api helpers
2807=Show Api List
2813=Show Api Constants
2808=Show Api Tooltip
2816=Show Struct Items
2860=Code properties
2810=Show Properties
2822=Auto refresh list
2819=Properties to Wordlist
2834=Enter list on Tab
2829=Show list on Shift+Space
2861=Other
2814=Code Write Macro
2823=Proc in statusbar
2818=Wordlist Case Convert
2830=Open Collapsed
2832=Auto brackets
2833=Code info
2836=Threaded build
2843=Minimize && wait on run
2835=Compiler error handling
2838=No handling
2839=Bookmark line
2840=Hilite line
2841=Bookmark and hilite line
2842=No visual handling
;--------------------------------------------------------------------------------
[2900]
2900=Version Info
1=OK
2=Cancel
2912=Name:
2913=ID:
2914=File Ver:
2915=Product Ver:
2916=OS:
2917=File Type:
2918=Language:
2919=Char Set:
2911=Export
;--------------------------------------------------------------------------------
[3000]
3000=Export ID Equ's To Output
3007=Selection
3002=&Select
3003=&Deselect
3004=Select &All
3005=Select &None
3006=&Invert Sel.
1=OK
2=Cancel
;--------------------------------------------------------------------------------
[3100]
3100=Sniplet Browser
3109=Add new
3108=Open
3103=Clr Output
3104=Select All
3105=Editor
3106=Clipboard
3107=Output
2=Close
;--------------------------------------------------------------------------------
[3200]
3200=Make Menu,Tools Menu,Help Menu,Macro Menu,Macro Add
1=OK
2=Cancel
3205=Insert
3206=Delete
3210=Menu item:
3211=Accelerator:
3212=Command:
;--------------------------------------------------------------------------------
[3300]
3300=Style,ExStyle
2=Close
;--------------------------------------------------------------------------------
[3400]
3400=RadASM Macro Recorder
1=Stop
;--------------------------------------------------------------------------------
[3500]
3500=Printer option
3513=Page numbering
3501=Left
3502=Center
3503=Right
3504=None
3505=Timestamp
3514=Page Heading
3506=Left
3507=Center
3508=Right
3509=None
3510=Project description
3515=Syntax
3511=Use Colors
1=OK
2=Cancel
10=Apply
;--------------------------------------------------------------------------------
[3600]
3600=Resource
1=OK
2=Cancel
3602=Export
3603=Add
3604=Delete
;--------------------------------------------------------------------------------
[3700]
3700=String table
1=OK
2=Cancel
3702=Export
3703=Add
3704=Delete
;--------------------------------------------------------------------------------
[3800]
3800=Add breakpoint variable
1=OK
2=Cancel
3803=Variable name:
3802=Clear
;--------------------------------------------------------------------------------
[3900]
3900=Tool Windows Options
1=OK
10=Apply
2=Cancel
3906=Allow right caption
3907=Multiline tab select tool
3908=Show divider line
3909=Tool clipping order
;--------------------------------------------------------------------------------
[4000]
4000=File Browser Option
4009=Folders:
1=OK
2=Cancel
4002=Add
4003=Delete
4010=Filter:
;--------------------------------------------------------------------------------
[4100]
4100=External File Option
4107=Filetype:
1=OK
2=Cancel
4102=Add
4103=Delete
4108=Command:
;--------------------------------------------------------------------------------
[4200]
4200=Colors & KeyWords
1=OK
2=Cancel
4026=Color Theme
4023=Save
4022=Delete
4021=Load
4027=Colors
4028=Syntax
4019=Group:
4007=Active:
4009=>
4008=<
4006=On Hold:
4011=Add
4010=Delete
4029=Hiliting
4018=Use hiliting
4025=Hilite active line
4024=Hilite comments
4016=Flicker free drawing
4017=Show divider line
4030=Font style / Group
4004=Bold
4003=Italic
4005=RC file
4002=Apply
;--------------------------------------------------------------------------------
[4300]
4300=Find ...
2010=Find what:
2009=Replace:
2011=Type
2003=Hex
2004=Ascii
2012=Direction
2005=Down
2006=Up
1=Find
2007=Replace
2008=Replace All
2=Cancel
;--------------------------------------------------------------------------------
[4400]
4400=Main Project Files
4406=File:
1=OK
2=Cancel
4407=File Name:
;--------------------------------------------------------------------------------
[4500]
4500=Project Groups
1=OK
2=Cancel
4502=Default groups when creating new projects:
;--------------------------------------------------------------------------------
[4600]
4600=Menu Accelerators
1=OK
2=Cancel
3=Delete
;--------------------------------------------------------------------------------
[4700]
4700=Accelerators
4707=Name:
4708=ID:
1=OK
2=Cancel
4703=Export
4702=Add
4701=Delete
;--------------------------------------------------------------------------------
[4800]
4800=Scan Project
4802=Word:
1=OK
2=Cancel
;--------------------------------------------------------------------------------
[4900]
1=OK
;--------------------------------------------------------------------------------
[5000]
5000=Language
1=OK
2=Cancel
5003=Language:
5004=Sub language:
;--------------------------------------------------------------------------------
[5100]
5100=Font options
1001=Code Edit
1002=Text Edit
1004=Hex Edit
1005=Line Number
1009=Dialog Edit
1003=Tool Window
1006=Printer
1017=Dialogs
1=OK
2=Cancel
1007=Apply
;--------------------------------------------------------------------------------
[5200]
5200=Block Insert
1=OK
2=Cancel
5202=Enter text to be inserted at every line in selected block.
;--------------------------------------------------------------------------------
[5300]
5300=File Association
2=Close
5301=(.rap) Project file
5302=(.asm) Assembly file
5303=(.inc) Include file
5304=(.dlg) Dialog file
5305=(.mnu) Menu file
5306=(.rc) Resource file
5307=Remove
1=Set
;--------------------------------------------------------------------------------
[5400]
5400=Language Option
5401=Language:
5403=Magnify:
1=OK
2=Cancel
10=Apply
;--------------------------------------------------------------------------------
[5500]
5500=Programming Languages
1=OK
2=Cancel
1003=Delete
1004=Add
;--------------------------------------------------------------------------------
[5600]
5600=Custom Controls
1=OK
2=Cancel
5603=Delete
5604=Add
;--------------------------------------------------------------------------------
[6000]
6000=Environment Variables
1=OK
2=Cancel
1001=Add
1002=Delete
1006=Name:
1007=Value:
;--------------------------------------------------------------------------------
[Strings]
1=Topmost File
2=Open Files
3=Selected Project File
4=All Project Files
5=Refresh
11=Project Browser
12=Project Groups
13=File Browser
14=File Filter
15=Up One Level
16=Previous Folder
17=Next Folder
20002=Assemble
20004=Build
20005=Go
20006=Run
29991=User button#1
29992=User button#2
40004=New File
40005=Open File
40007=Save File
40009=Save All Files
40011=Print
41001=Undo
41002=Redo
41003=Cut
41004=Copy
41005=Paste
41006=Delete
41008=Find
41011=Replace
41104=Toggle Bookmark
41105=Next Bookmark
41106=Previous Bookmark
41107=Clear All Bookmarks
42002=Show/Hide Toolbox
42003=Show/Hide Output
42004=Show/Hide Project
42005=Show/Hide Properties
43001=Indent
43002=Outdent
43003=Comment
43004=Uncomment
;--------------------------------------------------------------------------------
[998]
40001=&New Project	Ctrl+Shift+N
40002=&Open Project	Ctrl+Shift+O
40003=&Close Project	Ctrl+Shift+C
40013=&Delete project	Ctrl+Shift+D
44990=Add New
44101=&Asm File
44102=&Inc File
44103=&Rc File
44104=&Txt File
44105=&Dialog
44106=&Menu
44107=Mod&ule
44108=&File
44991=Add Existing
44201=&Files
44202=&Dialogs
44203=&Menus
44205=&Object Files
44206=Mod&ules
44033=&Current Open File
44010=Project &Groups
44008=Refresh &Project Properties
50001=Refresh &File Properties
50002=&Remove From Project
50024=Rena&me File
50003=&Lock / Unlock File
50014=&Copy name to code
50005=Open File
50006=Save File As
50007=Undo	Ctrl+Z
50008=Redo	Ctrl+Y
50101=Cut	Ctrl+X
50102=Copy	Ctrl+C
50103=Paste	Ctrl+V
50104=Delete	Del
50106=Copy All
50107=Cut All
50105=Clear
41001=Undo	Ctrl+Z
41003=Cut	Ctrl+X
41004=Copy	Ctrl+C
41005=Paste	Ctrl+V
41006=Delete	Del
43005=Lock controls
43006=Send to Back
43007=Bring to Front
43008=Show Grid
43991=Align
43901=Left
43902=Center
43903=Right
43904=Top
43905=Middle
43906=Bottom
43992=Same Size
43911=Width
43912=Height
43913=Both
44028=Center in Dialog
44029=Horizontal
44030=Vertical
44031=Set tabindexes
50009=Cut
50010=Copy
50011=Paste
50012=Delete
50013=Rename
50015=Copy name to code
50023=Explore
50016=&Goto Declare
50021=&Scan Project
50018=Find
50019=Find Next
50020=Find Previous
50017=Copy to code
50022=Create proto
50025=Expand All
50026=Collapse All
50029=Add Group
50028=Delete Group
50027=Edit Group
;--------------------------------------------------------------------------------
[999]
49900=&File
40001=&New Project	Ctrl+Shift+N
40002=&Open Project	Ctrl+Shift+O
40003=&Close Project	Ctrl+Shift+C
40013=&Delete Project	Ctrl+Shift+D
40004=Ne&w File	Ctrl+N
40005=O&pen File	Ctrl+O
40014=Open as &Hex	Ctrl+H
41021=&Reopen File	Ctrl+Shift+R
40006=Clos&e File	Ctrl+F4
40007=&Save File	Ctrl+S
40008=Save File &As	Ctrl+Shift+A
40009=Save All &Files	Ctrl+Shift+S
40990=&Recent Files
40010=Page Setup
40011=Print	Ctrl+P
40012=E&xit	Alt+F4
49901=&Edit
41001=&Undo	Ctrl+Z
41002=&Redo	Ctrl+Y
41022=Empty Undo Buffer	Ctrl+Shift+E
41003=C&ut	Ctrl+X
41004=&Copy	Ctrl+C
41005=&Paste	Ctrl+V
41006=&Delete	Del
41007=&Select All	Ctrl+A
41008=&Find	Ctrl+F
41009=Find &Next	F3
41010=Find &Previous	Ctrl+F3
41011=&Replace	Ctrl+R
41012=&Goto Line	Ctrl+G
41101=Find &Word	Shift+F2
41020=Find Next Word	Ctrl+Shift+F2
44023=Find Previous Word	Alt+F2
41102=F&ind Declare	F2
41103=R&eturn	Ctrl+F2
44019=Block
43001=&Indent	F9
43002=&Outdent	Ctrl+F9
43003=&Comment	Alt+F9
43004=&Uncomment	Alt+Ctrl+F9
43990=Con&vert
43501=Spaces To &Tab
43502=Tab To &Spaces
43503=&Uppercase
43504=&Lowercase
43505=T&rim Trailing Spaces
44015=&Block / Column Mode	Ctrl+B
44020=Block Insert / &Replace
41018=&Expand Block	Ctrl+E
43009=&Hide / Unhide Block
44016=Bookmark
41104=&Toggle BookMark	Shift+F8
41105=&Next BookMark	F8
41106=&Previous BookMark	Ctrl+F8
41107=&Clear BookMarks	Ctrl+Shift+F8
41990=Named BookMarks	Ctrl+0..9
41300=BookMark &0	Ctrl+0
41301=BookMark &1	Ctrl+1
41302=BookMark &2	Ctrl+2
41303=BookMark &3	Ctrl+3
41304=BookMark &4	Ctrl+4
41305=BookMark &5	Ctrl+5
41306=BookMark &6	Ctrl+6
41307=BookMark &7	Ctrl+7
41308=BookMark &8	Ctrl+8
41309=BookMark &9	Ctrl+9
44017=Break Point
41013=&Toggle BreakPoint	Alt+F8
41014=&Clear BreakPoints	Alt+Ctrl+F8
41015=Add &Variable	Alt+Shift+F8
44018=Error
41016=&Next Error	Shift+F3
41017=&Clear Errors	Ctrl+Shift+F3
41019=&Open	Alt+Ctrl+O
49902=&View
42001=&ToolBar
42002=Tool&Box
42003=&Output Window
42004=&Project Browser
42005=P&roperties
42006=Tab S&elect
42008=&Info Tool
42007=&StatusBar
44026=&Full Screen	Ctrl+W
49903=Fo&rmat
43005=&Lock Controls
43006=&Send To Back
43007=&Bring To Front
43008=Show &Grid
43991=&Align
43901=&Left
43902=&Center
43903=&Right
43904=&Top
43905=&Middle
43906=&Bottom
43992=Same Si&ze
43911=&Width
43912=&Height
43913=&Both
44028=&Center in Dialog
44029=&Horizontal
44030=&Vertical
44031=Set tabindexes
49904=&Project
44990=Add &New
44101=&Source / Asm File
44102=&Header / Inc File
44103=&Rc File
44104=&Txt File
44105=&Dialog
44106=&Menu
44107=Mod&ule
44108=&File
44991=Add &Existing
44201=&Files
44202=&Dialogs
44203=&Menu
44205=&Object Files
44206=Mod&ules
44033=&Current Open File
44011=&Accelerator
44001=&Resource
44007=&Stringtable
44002=&Versioninfo
44013=&Language
44004=Remove &From Project
44992=Set Assembler
44010=Project &Groups
44006=&Project Options
44009=&Main Project Files
44008=Refres&h Properties
44012=Scan Project
44003=Export To &Output
44005=&Create Template
44993=Create &Text Link
44701=&Note
44702=&Bug
44703=&Todo
49905=&Make
49906=&Tools
46001=&Sniplets	F11
46002=&Export ID Equ's	Ctrl+F11
49907=&Window
47009=&Split / Close Split	F4
47001=Close &Window	Ctrl+F4
47002=Close &All	Ctrl+Shift+F4
44032=Close All &But Current
47003=&Next Window	F6
47004=&Previous Window	Ctrl+F6
41401=Goto Window	Alt+0..9
47013=Goto Edit	F12
47014=Goto Project	Ctrl+F12
47015=Goto Property	Shift+F12
47016=Goto Output	Ctrl+Shift+F12
47005=Tile &Horizontal	F7
47006=Tile &Vertical	Ctrl+F7
47007=&Cascade	Shift+F7
47008=Arrange &Icons	Ctrl+Shift+F7
47010=&Maximize	Alt+F7
47011=&Restore	Alt+Ctrl+F7
47012=Minimi&ze	Alt+Shift+F7
49908=&Option
44022=&Language
44024=&Programming Languages
48003=Code &Editor Options
48001=&Colors && KeyWords
48004=&Dialog Editor Options
44025=C&ustom Controls
48015=Pri&nter Options
44014=&Font Options
48017=&Menu Accelerators
44021=File &Association
48012=File &Browser
48013=E&xternal File Types
48005=&Sniplets
48006=Set &Paths
44027=Environment &Variables
48011=Tool &Windows
48007=&Make Menu
48008=&Tools Menu
48009=&Help Menu
49909=M&acro
46301=&Record
46303=&Manage
49910=&Help
49001=&About
;--------------------------------------------------------------------------------
[AddinMana]
AddinMana=RadASM Addin Manager
1=OK
2=Cancel
10=Apply
1032=Install
1033=Uninstall
1008=Help
1001=Addins:
1002=Options
1003=Info
1004=Description:
1005=Author:
1006=Version:
1007=Date:
2000=Addin Manager
3000=Enable
;--------------------------------------------------------------------------------
[FlipCase]
2000=Flip Case
2001=Page Break
3000=Flip Case
3001=Page Break
3002=Auto Show Output
3003=Auto Hide Output
3004=Auto Show ToolBox
3005=Create Temp
3006=No Exception Handler
3007=Compile time
;--------------------------------------------------------------------------------
[PthExpl++]
PthExpl++=Set Minor Files
1001=OK
1003=Cancel
1004=<< Add
1005=Remove >>
1007=Auto delete
1008=Ask me first
2000=Path Explore
2001=Set Minor Files
2002=Delete Minor Files
3000=Enable
;--------------------------------------------------------------------------------
[FontBuilder]
2000=Font Builder
;--------------------------------------------------------------------------------
[ProjectZip]
ProjectZip=RadASM project zipper
2=Exit
1002=Zip && E-Mail
1004=Zip
1007=Select all
1009=Zip To:
1010=Current:
2000=Project Zipper
3000=Enable Project zipper
3001=Add date to zipname
;--------------------------------------------------------------------------------
[AsmVars]
2000=AsmVars
3000=Enable AsmVars
;--------------------------------------------------------------------------------
[asciiTab]
asciiTab=Esc to exit
2000=Ascii Table
3000=Enable Ascii Table
4000=Ascii Table
;--------------------------------------------------------------------------------
[CreateProto]
CreateProto=Create Proto
1=OK
2=Cancel
2000=Create Proto
;--------------------------------------------------------------------------------
[CreateProtoEx]
CreateProtoEx=Create Proto
1008=Select All
1002=Send To Output Window
1001=Done
1003=Create Proto in File
1004=Enable File Creation
1007=Creates a file of the function prototypes at every build, overwriting the old one.
2000=Create Proto
;--------------------------------------------------------------------------------
[RadFavs]
2000=Favourites
2001=Add to favourites
2002=Manage favourites
[RadFavs#1]
RadFavs#1=Add to favourites
1001=Label
1003=Path
1=OK
2=Cancel
[RadFavs#2]
RadFavs#2=Manage favourites
1107=Label
1108=Update
1103=Info
1=OK
2=Cancel
;--------------------------------------------------------------------------------
[AlexMenu]
3000=Default menu
3001=Cool menu
3002=Cool bar white
3003=Cool bar blue
3004=Cool bar green
3005=Cool bar red
3006=Cool body white
3007=Cool body blue
3008=Cool body green
3009=Cool body red
;--------------------------------------------------------------------------------
[BitMask]
BitMask=BitMask
141=Byte 3 (high order)
102=Byte 2
103=Byte 1
104=Byte 0 (low order)
139=Output
140=Output
151=Use
142=NOT
143=RESET
149=Hexadecimal
150=Decimal
3000=Enable Bitmask
4000=Bit mask generator
;--------------------------------------------------------------------------------
[Colref]
Colref=Color
740=Basic colors
741=Custom colors
730=Color
731=Solid
723=Hue:
724=Sat:
725=Lum:
726=Red:
727=Green:
728=Blue:
1007=RGB (red,green,blue): 
1008=HEX value: 
1009=DEC value: 
719=&Define Custom Colors >>
1=OK
2=Cancel
105=Capture
104=Color Ref
712=&Add to Custom Colors
1038=Help
1001=Insert
1002=Insert
1003=Insert
2000=Colref
3000=Enable color reference
3001=Disable color flashing
3002=Disable blue dialog
4000=Color reference
;--------------------------------------------------------------------------------
[Preview]
4000=Preview dialog
;--------------------------------------------------------------------------------
[RadToolBar]
3000=Enable custom ToolBar
3001=Use phoenity buttons
3002=Use grayed images
3003=Extract tool icons
3004=Use tool icon files
;--------------------------------------------------------------------------------
[RADbg]
RADbg=RadASM debug
1004=Hex
1005=Dec
1006=Bin
1002=Clear
1001=Terminate
1=OK
3000=Show debug dialog
3001=Int 3 debug
3002=Result to output
;--------------------------------------------------------------------------------
[ReallyRad]
ReallyRad=ReallyRad Options
201=Auto add dialog
202=Auto add menu
203=Auto update resource
207=Auto update string table
205=Auto add main RC file
206=Auto create Res folder
204=Auto update versioninfo
208=Auto update resources
301=Control double click
302=Dialog menu select
303=Unique control names
304=Check module build time
1=OK
2=Cancel
10=Apply
2000=ReallyRad
2001=ReallyRad - CodeWrite
3000=Enable ReallyRad
[ReallyRad#2]
ReallyRad#2=ReallyRad - CodeWrite
9006=Module Name:
9007=Template:
9008=Proc name
1=OK
2=Cancel
;--------------------------------------------------------------------------------
[StyleMana]
StyleMana=Style manager
1004=&DWORD:
1003=Update
2=Close
;--------------------------------------------------------------------------------
[RADebug]
RADebug=Do not debug
1007=Do not debug:
1008=Debug:
1=OK
2=Cancel
2000=Deb&ug:
2001=Toggle &Breakpoint	Ctrl+T
2002=&Clear Breakpoints	Ctrl+Shift+T
2003=&Run	Shift+F7
2004=Brea&k	Ctrl+Alt+F7
2005=&Stop	Alt+F7
2006=Step &Into	F7
2007=Step &Over	Ctrl+F7
2008=Run &To Caret	Ctrl+Shift+F7
2009=Do not Debug
2010=Debug Window
;--------------------------------------------------------------------------------
